src/app/Controllers/Auth/RegisterStep2.php

INSERT INTO `users` (`nom`, `prenom`, `email`, `password`, `genre`) VALUES ('Rindra', 'Raharinosy', 'katsu.exe@outlook.com', '$2y$10$2kWuaTvQN5XmFan7cRTUduA1eETsYayZWdRuRo3R4EX4WxtD3xSHC', 'homme')
INSERT INTO `user_sante` (`user_id`, `taille`, `poids`, `objectif`) VALUES (6, 173, 63, 'augmenter')
SELECT *
FROM `users`
WHERE `users`.`id` = 6
---
    public function store()
    {
        $step1 = session()->get('register_step1');

        if (! is_array($step1)) {
            return redirect()->to('/inscription/etape1')->with('error', 'Votre session d inscription a expire.');
        }

        $rules = [
            'taille'   => 'required|numeric|greater_than[100]|less_than[250]',
            'poids'    => 'required|numeric|greater_than[30]|less_than[300]',
            'objectif' => 'required|in_list[augmenter,reduire,ideal]',
        ];

        if (! $this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $userModel = new UserModel();
        $santeModel = new UserSanteModel();

        $userId = $userModel->insert([
            'nom'      => $step1['nom'],
            'prenom'   => $step1['prenom'],
            'email'    => $step1['email'],
            'password' => password_hash($step1['password'], PASSWORD_DEFAULT),
            'genre'    => $step1['genre'],
        ], true);

        $santeModel->insert([
            'user_id'  => $userId,
            'taille'   => (float) $this->request->getPost('taille'),
            'poids'    => (float) $this->request->getPost('poids'),
            'objectif' => (string) $this->request->getPost('objectif'),
        ]);

        $profile = $userModel->find($userId);